<html>
<head>
<meta charset="iso-8859-1">
<title>Brython</title>
<link rel="stylesheet" href="../doc_brython.css">
</head>
<body>
<a name="modele"><h3>Compilando y ejecutando</h3>


<h4>Visi&oacute;n general</h4>
<table border=1 cellpadding =5>
<tr><td>Paso </td><td>llevado a cabo por</td></tr>
<tr>
    <td>Leyendo c&oacute;digo Python</td>
    <td>funci&oacute;n <code>brython(<i>debug_mode</i>)</code> en <b>py2js.js</b>
        <p>Si el c&oacute;digo es un fichero externo, se obtendr&aacute; mediante una llamada Ajax
        <p>Esta funci&oacute;n crea las siguientes variables de entorno :
        <ul>
         <li><code>document.$py_src</code> : objeto indexado mediante los nombres de los m&oacute;dulos, el valor es el c&oacute;digo fuente del m&oacute;dulo
         <li><code>document.$debug</code> : nivel de depuraci&oacute;n
         <li><code>document.$exc_stack</code> : una lista de errores generados durante el 'parseo' o durante el tiempo de ejecuci&oacute;n
        </ul>
        
    </td>

</tr>

<tr>
    
    <td>Creaci&oacute;n del &aacute;rbol representando al c&oacute;digo Python</td>
    <td>funci&oacute;n <code>$py2js(<i>source,module</i>)</code> in <b>py2js.js</b>
        <p>Esta funci&oacute;n llama a :
        <ul>
         <li><code>$tokenize(<i>source</i>)</code> : an&aacute;lisis sint&aacute;ctico de los tokens en el c&oacute;digo fuente Python y en la construcci&oacute;n del &aacute;rbol. ;
             Devuelve la ra&iacute;z del &aacute;rbol
         <li><code>transform(<i>root</i>)</code> : transforma el &aacute;rbol para prepararlo para la conversi&oacute;n a Javascript (ver debajo)
         <li><code>$add_line_num()</code> para a&ntilde;adir n&uacute;meros de l&iacute;nea en el caso de que el 'debug mode' sea superior a 0
        </ul>
        <p>The funci&oacute;n <code>$py2js</code> devuelve la ra&iacute;z del &aacute;rbol.
    </td>
</tr>

<tr>
    
    <td>generando c&oacute;digo Javascript</td>
    <td>m&eacute;todo <code>to_js()</code> del &aacute;rbol devuelto por <code>$py2js</code>
        <p>Esta funci&oacute;n llama de forma recursiva al m&eacute;todo del mismo nombre y a todos los elementos sint&aacute;cticos encontrados en el &aacute;rbol. Devuelve la cadena que contiene el c&oacute;digo Javascript resultante. Si el 'debug mode' es 2, esta cadena se mostrar&aacute; en la consola del navegador.
    </td>
</tr>

<tr>
    
    <td>ejecutando c&oacute;digo Javascript</td>
    <td>evaluaci&oacute;n mediante la funci&oacute;n <code>eval()</code>
    
    </td>
</tr>

</table>

<p>
<h4>Fiicheros usados</h4>

El script <b>brython.js</b> se genera mediante la compilaci&oacute;n de varios scripts :
<ul>
<li><b>brython_builtins.js.js</b> : define el objeto <code>__BRYTHON__</code> que act&uacute;a como pasarela entre objetos Javascript nativos (<code>Date, RegExp, Storage...</code>) y Brython
<li><b>py2js.js</b> : realiza la conversi&oacute;n de c&oacute;digo Python a c&oacute;digo Javascript
<li><b>py_utils.js</b> : funciones &uacute;tiles (eg conversiones de tipos entre Javascript y Python)
<li><b>py_string.js</b> : implementaci&oacute;n de la clase Python <code>str</code>, basada en el tipo Javascript <code>String</code>
<li><b>py_list.js</b> : implementaci&oacute;n de la clase Python <code>list</code>, basada en el tipo Javascript <code>Array</code>
<li><b>py_classes.js</b> : grupos de todas las funciones y tipos Python integrados
<li><b>py_import.js</b> : implementaci&oacute;n de <tt>import</tt>
<li><b>py_dom.js</b> : interacci&oacute;n con el documento HTML (DOM)
<li><b>py_ajax.js</b> : implementaci&oacute;n Ajax
</ul>


<p>
<h4>M&aacute;s sobre traducci&oacute;n y ejecuci&oacute;n</h4>

Traducci&oacute;n y ejecuci&oacute;n de un script Brython mediante <b>py2js.js</b> sigue los siguientes pasos :
<ol>
<li>An&aacute;lisis sint&aacute;ctico y creaci&oacute;n del &aacute;rbol
<p>Este paso se basa en un aut&oacute;mata cuyo estado evoluciona con los tokens encontrados en el c&oacute;digo fuente
<p>El c&oacute;digo Python se separa en tokens que pueden poseer los siguientes tipos : 
<ul>
<li>keyword
<li>identificador
<li>literal (string, integer, float)
<li>operador
<li>period (.)
<li>colon (:)
<li>semi colon (;)
<li>par&eacute;ntesis / corchete ('bracket') / llave ('curly brace')
<li>asignaci&oacute;n (signo igual =)
<li>decorador (@)
<li>fin de l&iacute;nea
</ul>

<p>Para cada token, Se produce una llamada a la funci&oacute;n <tt>$transition()</tt>, devolver&aacute; un nuevo estado dependiendo del estado actual y del token
<p>Cada instrucci&oacute;n en el c&oacute;digo fuente encuentra un nodo en el &aacute;rbol (una instancia de la clase <tt>$Node</tt>). Si una l&iacute;nea contiene m&aacute;s de una instrucci&oacute;n separadas por ":" (<code>def foo(x):return x</code>) o por ";" (<code>x=1;print(x)</code>), se crear&aacute;n tantos nodos para esa l&iacute;nea
<p>Cada elemento sint&aacute;ctico (identificador, llamada a funci&oacute;n, expresi&oacute;n, operador,...) es manejado mediante una clase : ver en el c&oacute;digo fuente de <b>py2js.js</b> entre <code>function $AbstractExprCtx</code> y <code>function $UnaryCtx</code>
<p>En este paso, se puede informar de los errores : 
<ul>
<li>errores sint&aacute;cticos
<li>errores de indentaci&oacute;n
<li>cadenas literales inacabadas
<li>falta de par&eacute;ntesis / corchetes ('brackets') / llaves ('curly braces')
<li>caracteres ilegales
<li>Palabras clave Python no gestionadas por Brython
</ul>
<p>
<li>Transformando el &aacute;rbol
<p>Para algunos elementos de la sintaxis Python, el &aacute;rbol que representa el c&oacute;digo fuente debe ser modificado (a&ntilde;adiendo ramas) antes de comenzar la traducci&oacute;n a Javascript. Esto se realiza mediante llamadas recursivas al m&eacute;todo <code>transform()</code> desde el principio del &aacute;rbol 
<p>Por ejemplo, en el primer paso, el c&oacute;digo Python <code>assert <i>condition</i></code> produce una &uacute;nica rama del &aacute;rbol. El segundo paso lo transforma a una rama <code>if not <i>condition</i></code> y a&ntilde;ade una rama hija con <code>raise AssertionError</code>
<p>Los elementos que deben ser transformados de esta forma son : <code>assert</code>, cadenas (<code>x=y=0</code>) y asignaciones m&uacute;ltiples (<code>x,y=1,2</code>), <code>class, def, except, for, try</code>
<p>Este paso se usa, adem&aacute;s, para almacenar las variables declaradas mediante <code>global</code>

<p>
<li>Ejecutando c&oacute;digo Javascript
<p>En el momento de ejecuci&oacute;n, el script generado puede hacer uso de :
<ul>
<li>las clases definidas en <tt>py_classes.js, py_string.js, py_list.js, py_dom.js, py_ajax.js</tt>
<li>funciones internas no accesibles desde Python (sus nombres siempre comienzan con $) ; la mayor&iacute;a de ellas se definen en <tt>$py_utils.js</tt>. Las m&aacute;s importantes son :
<ul>
<li><tt>$JS2Py</tt> : toma un solo argumento y devuelve :
<ul>
<li>el argumento sin cambiar si es un tipo soportado por Brython (i.e. si tiene un atributo clase <tt>__class__</tt>)
<li>una instancia de DOMObject (respectivamente DOMEvent) si el argumento es un objeto DOM (resp. evento)
<li>una instancia de JSObject "envolviendo" al argumento en el resto de casos
</ul>
<li><tt>$MakeArgs</tt> llamado al inicio de cada funci&oacute;n si su firma posee al menos un argumento. Crea un espacio de nombres basado en los argumentos de la funci&oacute;n, llamando a la funci&oacute;n <code>$JS2Py</code> en todos los argumentos
<li><tt>$class_constructor</tt> Se le llama para la definici&oacute;n de la clase
<li><tt>$resolve_attr</tt> se le llama para resolver atributos de instancias de clases y maneja herencia m&uacute;ltiple
<li><tt>$list_comp</tt> se le llama para las comprensiones de listas
<li><tt>$lambda</tt> se le llama para funciones an&oacute;nimas definidas por <code>lambda</code>
<li><tt>$test_expr</tt> y <tt>$test_item</tt> se usan en la evaluaci&oacute;n de condiciones combinadas mediante <code>and</code> o <code>or</code>
</ul>
<li>las funciones definidas en el script <tt>py_import.js</tt> se usan para la gesti&oacute;n de los imports
</ul>

</ol>
</body>
</html>
